# language: zh-TW

功能: 隨機產生商品價格

場景大綱: 有 <count> 個 ( <MinRange> ~ <MaxRange> ) <min> ~ <max> 金額隨機產生的商品

場景: 每個價格範圍區間產生一定數量的商品
	假設 玩家進入遊戲
	並且 按下開始遊戲按鈕
	當 在遊戲回合一開始
	那麼 產生 <count> 個 <min> ~ <max> 金額的商品價格

	例子:
    |  min  |  max  | count | MinRange | MaxRange |
	|    50 |   300 |    5  |     5    |     8    |
	|   301 |   800 |    6  |     6    |    10    |
	|   801 |  1600 |    8  |     8    |    12    |
	|  1601 |  2400 |   10  |    10    |    14    |
	|  2401 |  3200 |   11  |    11    |    16    |
	|  3201 |  4000 |   10  |    10    |    14    |
	|  4001 |  4800 |    9  |     9    |    12    |
	|  4801 |  5600 |    8  |     8    |    11    |
	|  5601 |  6400 |    7  |     7    |    10    |
	|  6401 |  7200 |    6  |     6    |     8    |
	|  7201 |  8000 |    5  |     5    |     7    |
	|  8001 |  9600 |    4  |     4    |     6    |
	|  9601 | 11200 |    3  |     3    |     5    | 
	| 11201 | 12800 |    3  |     3    |     4    |
	| 12801 | 14400 |    2  |     2    |     3    |
	| 14401 | 16000 |    1  |     1    |     2    |
	| 16001 | 18000 |    1  |     0    |     1    |
	| 18001 | 20000 |    1  |     0    |     1    |

	